{
  "header": {
    "name": "Alexandru",
    "surname": "Bejenaru",
    "profession": "DESARROLLADOR DE APLICACIONES WEB",
    "phone": "642 954 953",
    "email": "alex.bejenaru93@gmail.com",
    "linkedin": "alexbeje",
    "github": "AlexBeje"
  },
  "summary": {
    "section": {
      "title": "Resumen"
    },
    "content": "Desarrollador de aplicaciones web con más de 5 años de experiencia trabajando con tecnologías agile para entregar productos de la mejor calidad. Diplomático, amable y experto en el manejo de situaciones delicadas. Altamente organizado, motivado y competente con las nuevas tecnologías. Grado en Multimedia."
  },
  "experience": {
    "section": {
      "title": "Experiencia"
    },
    "items": [
      {
        "id": "1",
        "title": "Accenture PLC",
        "date": "Jun. 2021 - Present",
        "projects": [
          {
            "id": "1",
            "title": "Nueva Zona Zurich (Vue)",
            "skills": [
              "He formado parte del equipo Front en la implementación del nuevo portal de cliente de Zurich.",
              "Utilizando los conocimientos de la arquitectura Zurich previamente adquiridos, he podido llevar a cabo las tareas enfrentadas de una manera mucho más ágil e efectiva.",
              "Junto con el  equipo, hemos implementado una arquitectura enfocada en la distribución adecuada de los componentes creados para su reutilización dentro de la aplicación.",
              "Como herramienta principal de desarrollo se ha utilizado la librería Vue 2 con la extensión class components.",
              "Se ha tipado el código utilizando el lenguaje Typescript.",
              "He creado diccionarios de datos, utilizado los SWAGGERS generados en un entorno FIB (Front In Back) y he adaptado los servicios creados en la parte Front.",
              "Se ha seguido un design system basado en la librería Element UI, utilizando el framework SCSS con la metodología BEM.",
              "He aprendido a hacer testing utilizando las librerías Jest y Vue Test Utils.",
              "He manejado Gitlab como herramienta principal de gestión de versiones.",
              "He trabajado en un entorno Scrum de Agile utilizando Jira como herramienta principal de asignación de tareas."
            ]
          },
          {
            "id": "2",
            "title": "Web Component (Vue)",
            "skills": [
              "Como Design Lead, mis tareas principales en el proyecto han sido el rediseño completo de la aplicación de contratación de pólizas llamada Web Component de Zurich para Volkswagen, la adaptación del componente al branding de Volkswagen (Seat, Skoda, Audi), y la adaptación del componente a los agentes de Zurich.",
              "Se han adquirido conocimientos de la arquitectura Zurich.",
              "Como herramienta principal de desarrollo se ha utilizado la librería Vue 2 con la extensión class components.",
              "Se ha tipado el código utilizando el lenguaje Typescript.",
              "He creado diccionarios de datos, utilizado los SWAGGERS generados en un entorno FIB (Front In Back) y he adaptado los servicios creados en la parte Front.",
              "Se ha seguido un design system basado en la librería Element UI, utilizando el framework SCSS con la metodología BEM.",
              "He aprendido a hacer testing utilizando las librerías Jest y Vue Test Utils.",
              "He manejado Gitlab como herramienta principal de gestión de versiones.",
              "He trabajado en un entorno Scrum de Agile utilizando Jira como herramienta principal de asignación de tareas."
            ]
          }
        ]
      },
      {
        "id": "2",
        "title": "GFT Technologies SE",
        "date": "Jun. 2016 - Jun. 2021",
        "projects": [
          {
            "id": "1",
            "title": "BBVA (Angular)",
            "skills": [
              "He participado en el refactoring de la GUI de la aplicación interna de BBVA llamada PKI.",
              "Como rol principal Front End Team Leader, mis tareas diarias fueron encontrar mejoras (componentizar elementos, generar un ecosistema de code quality, mejorar la arquitectura de los elementos visuales, etc.) en la aplicación desarrollada.",
              "Se ha utilizado Angular como herramienta principal, junto con el lenguaje tipado Typescript.",
              "Se han implementado llamadas REST a partir de los servicios desarrollados por el equipo Back utilizando el lenguaje de código abierto Go.",
              "Se ha utilizado el SCSS con la nomenclatura BEM para desarrollar los estilos de la aplicación."
            ]
          },
          {
            "id": "2",
            "title": "One Creation (Angular)",
            "skills": [
              "He participado en el proyecto internacional One Creation, con los stakeholders en USA, los designers en UK y los desarrolladores en España.",
              "El rol principal en el proyecto fue Design lead, teniendo como objetivo el desarrollo de la parte visual de la aplicación.",
              "A partir de diseños maquetados en Figma, se utilizaron los lenguajes SCSS con la metodología BEM, el toolkit de Bootstrap y el framework de Angular (ver. 9) junto con el lenguaje tipado TypeScript, hemos deployado el MVP de la aplicación One Creation.",
              "Se ha utilizado Notion como herramienta principal de coordinación de tareas utilizando la metodología agile como base."
            ]
          },
          {
            "id": "3",
            "title": "Sabadell (Stencil.js)",
            "skills": [
              "Hemos creado componentes web utilizando la herramienta Stencil.js de Ionic.",
              "Como miembro del equipo core, mi trabajo era crear los componentes base a partir de un diseño realizado en Sketch y pasado a los developers a traves de la herramienta Zeplin. Una vez acabado el desarrollo, se pasaron los componentes a los otros equipos para que lo implementen",
              "Hemos utilizado como lenguaje base el javascript con el sintaxis JSX y la metodología Atomic Design para la organización de los componentes.",
              "Se ha tipado el código utilizando el lenguaje Typescript.",
              "Para crear el estilo de la app se ha utilizado el lenguaje SCSS con la nomenclatura BEM.",
              "Se han organizado los varios equipos mediante la metodología SAFe de Agile."
            ]
          },
          {
            "id": "4",
            "title": "Deutsche Bank (Cobol)",
            "skills": [
              "Utilizamos el lenguaje Cobol (en la plataforma Mainframe) como herramienta principal de programación para la implementación de la regla MiFID en Deutsche Bank.",
              "También he adquirido experiencia con el lenguaje JCL (Lenguaje de Control de Trabajo)."
            ]
          }
        ]
      }
    ]
  },
  "education": {
    "section": {
      "title": "Educación"
    },
    "items": [
      {
        "id": "1",
        "title": "UOC (Universitat oberta de Catalunya)",
        "date": "Sep. 2018 - Present",
        "projects": [
          {
            "id": "1",
            "title": "Interacción Digital y Multimedia",
            "skills": [
              "He aprendido los conceptos básicos de diseño gráfico (teoría de los colores, tipografia, layout, etc.).",
              "He aprendido como realizar / editar videos de manera avanzada siguiendo los patrones de la regla de los tercios y otras técnicas.",
              "He utilizado la herramienta SketchUp para transformar objetos 2d en objetos 3d.",
              "He hecho una introducción a fondo sobre la base de los lenguajes HTML y CSS y Javascript.",
              "He desarrollado una app de podcast siguiendo los principios del diseño de la interacción (des del research hasta el producto interactivo maquetado en figma)."
            ]
          }
        ]
      },
      {
        "id": "2",
        "title": "IES Caparella",
        "date": "Sep. 2008 - Jun. 2012",
        "projects": [
          {
            "id": "1",
            "title": "DAW (Desarrollo de Aplicaciones Web)",
            "skills": [
              "He aprendido a arreglar y mantener sistemas informáticos.",
              "He adquirido conocimientos básicos del lenguaje SQL.",
              "He hecho la introducción a la programación mediante la herramienta C++.",
              "Se me ha introducido el lenguaje Javascript, el framework JQuery y he desarrollado blogs y paginas web mediante Wordpress."
            ]
          }
        ]
      }
    ]
  },
  "courses": {
    "section": {
      "title": "Cursos"
    },
    "items": [
      {
        "id": "1",
        "title": "Udemy, Inc.",
        "date": "Ene. 2021",
        "role": "CSS - The Complete Guide",
        "skills": [
          "CSS",
          "SCSS"
        ]
      }
    ]
  },
  "extracurricular": {
    "section": {
      "title": "Actividades extracurriculares"
    },
    "items": [
      {
        "id": "1",
        "title": "GitHub, Inc.",
        "date": "Mar. 2022",
        "role": "Resume / CV Website",
        "skills": [
          "React",
          "i18next",
          "React ElementUI",
          "Tailwind",
          "React Icons"
        ]
      }
    ]
  }
}