{
  "header": {
    "name": "Alexandru",
    "surnames": "Bejenaru",
    "profession": "DESARROLLADOR DE APLICACIONES WEB",
    "phone": "642 954 953",
    "email": "alex.bejenaru93@gmail.com",
    "linkedin": "alexbeje",
    "github": "AlexBeje"
  },
  "summary": {
    "section": {
      "title": "Resumen"
    },
    "content": "Desarrollador de aplicaciones web con más de 5 años de experiencia trabajando con tecnologías agile para entregar productos de la mejor calidad. Diplomático, amable y experto en el manejo de situaciones delicadas. Altamente organizado, motivado y competente con las nuevas tecnologías. Grado en Interacción Digital y Multimedia."
  },
  "experience": {
    "section": {
      "title": "Experiencia"
    },
    "items": [
      {
        "id": "1",
        "title": "Accenture PLC",
        "date": "Jun. 2021 - Presente",
        "projects": [
          {
            "id": "1",
            "title": "Nueva Zona Zurich (Vue & Jest)",
            "skills": [
              {
                "title": "He formado parte del equipo Front en la implementación del nuevo portal de cliente de Zurich."
              },
              {
                "title": "Utilizando los conocimientos de la arquitectura Zurich previamente adquiridos, he podido llevar a cabo las tareas enfrentadas de una manera mucho más ágil e efectiva."
              },
              {
                "title": "Junto con el  equipo, hemos implementado una arquitectura enfocada en la distribución adecuada de los componentes creados para su reutilización dentro de la aplicación."
              },
              {
                "title": "Como herramienta principal de desarrollo se ha utilizado la librería Vue 2 con la extensión class components."
              },
              {
                "title": "Se ha tipado el código utilizando el lenguaje Typescript."
              },
              {
                "title": "He creado diccionarios de datos, he utilizado los SWAGGERS generados en un entorno FIB (Front In Back) y he adaptado los servicios creados en la parte Front."
              },
              {
                "title": "Se ha seguido un design system basado en la librería Element UI, utilizando el framework SCSS con la metodología BEM."
              },
              {
                "title": "He aprendido a hacer testing utilizando las librerías Jest y Vue Test Utils."
              },
              {
                "title": "He manejado Gitlab como herramienta principal de gestión de versiones."
              },
              {
                "title": "He trabajado en un entorno Scrum de Agile utilizando Jira como herramienta principal de asignación de tareas."
              }
            ]
          },
          {
            "id": "2",
            "title": "Web Component (Vue & Jest)",
            "skills": [
              {
                "title": "Como Design Lead, mis tareas principales en el proyecto han sido el rediseño completo de la aplicación de contratación de pólizas llamada Web Component de Zurich para Volkswagen, la adaptación del componente al branding de Volkswagen (Seat, Skoda, Audi), y la adaptación del componente a los agentes de Zurich."
              },
              {
                "title": "Se han adquirido conocimientos de la arquitectura Zurich."
              },
              {
                "title": "Como herramienta principal de desarrollo se ha utilizado la librería Vue 2 con la extensión class components."
              },
              {
                "title": "Se ha tipado el código utilizando el lenguaje Typescript."
              },
              {
                "title": "He creado diccionarios de datos, utilizado los SWAGGERS generados en un entorno FIB (Front In Back) y he adaptado los servicios creados en la parte Front."
              },
              {
                "title": "Se ha seguido un design system basado en la librería Element UI, utilizando el framework SCSS con la metodología BEM."
              },
              {
                "title": "He aprendido a hacer testing utilizando las librerías Jest y Vue Test Utils."
              },
              {
                "title": "He manejado Gitlab como herramienta principal de gestión de versiones."
              },
              {
                "title": "He trabajado en un entorno Scrum de Agile utilizando Jira como herramienta principal de asignación de tareas."
              }
            ]
          }
        ]
      },
      {
        "id": "2",
        "title": "GFT Technologies SE",
        "date": "Jun. 2016 - Jun. 2021",
        "projects": [
          {
            "id": "1",
            "title": "BBVA (Angular 2)",
            "skills": [
              {
                "title": "He participado en el refactoring de la GUI de la aplicación interna de BBVA llamada PKI."
              },
              {
                "title": "Como rol principal Front End Team Leader, mis tareas diarias fueron encontrar mejoras (componentizar elementos, generar un ecosistema de code quality, mejorar la arquitectura de los elementos visuales, etc.) en la aplicación desarrollada."
              },
              {
                "title": "Se ha utilizado Angular 2 como herramienta principal, junto con el lenguaje tipado Typescript."
              },
              {
                "title": "He implementado llamadas REST a partir de los servicios desarrollados por el equipo Back utilizando el lenguaje de código abierto Go."
              },
              {
                "title": "He utilizado el SCSS con la nomenclatura BEM para desarrollar los estilos de la aplicación."
              }
            ]
          },
          {
            "id": "2",
            "title": "One Creation (Angular 2)",
            "skills": [
              {
                "title": "He participado en el proyecto internacional One Creation, con los stakeholders en USA, los designers en UK y los desarrolladores en España."
              },
              {
                "title": "El rol principal en el proyecto fue Design lead, teniendo como objetivo el desarrollo de la parte visual de la aplicación."
              },
              {
                "title": "A partir de diseños maquetados en Figma, se utilizaron los lenguajes SCSS con la metodología BEM, el toolkit de Bootstrap y el framework de Angular 2 junto con el lenguaje tipado TypeScript, hemos deployado el MVP de la aplicación One Creation."
              },
              {
                "title": "Hemos utilizado Notion como herramienta principal de coordinación de tareas utilizando la metodología agile como base."
              }
            ]
          },
          {
            "id": "3",
            "title": "Sabadell (Stencil.js)",
            "skills": [
              {
                "title": "Hemos creado componentes web utilizando la herramienta Stencil.js de Ionic."
              },
              {
                "title": "Como miembro del equipo core, mi trabajo era crear los componentes base a partir de un diseño realizado en Sketch y pasado a los developers a traves de la herramienta Zeplin. Una vez acabado el desarrollo, se pasaron los componentes a los otros equipos para que lo implementen"
              },
              {
                "title": "Hemos utilizado como lenguaje base el javascript con el sintaxis JSX y la metodología Atomic Design para la organización de los componentes."
              },
              {
                "title": "Se ha tipado el código utilizando el lenguaje Typescript."
              },
              {
                "title": "Para crear el estilo de la app se ha utilizado el lenguaje SCSS con la nomenclatura BEM."
              },
              {
                "title": "Se han organizado los varios equipos mediante la metodología SAFe de Agile."
              }
            ]
          },
          {
            "id": "4",
            "title": "Deutsche Bank (Cobol)",
            "skills": [
              {
                "title": "Utilizamos el lenguaje Cobol (en la plataforma Mainframe) como herramienta principal de programación para la implementación de la regla MiFID en Deutsche Bank."
              },
              {
                "title": "También he adquirido experiencia con el lenguaje JCL (Lenguaje de Control de Trabajo)."
              }
            ]
          }
        ]
      }
    ]
  },
  "skills": {
    "section": {
      "title": "Habilidades"
    },
    "items": [
      {
        "id": "1",
        "title": "Javascript",
        "blocks": [
          {
            "id": "1",
            "title": "NIVEL 1",
            "type": "primary",
            "description": "- Conocimiento sobre el Engiene, Runtime y el JIT Compiler de Javascript. <br/><br/> - Conocimiento sobre conceptos como Call Stack, Stack Overflow, Execution Context y Lexical Environment."
          },
          {
            "id": "2",
            "title": "NIVEL 2",
            "type": "primary",
            "description": "- Dominar conceptos como Scope Chain, Hoisting, Function Scope y Block Scope, saber la diferencia entre Dynamic y Lexical Scope. <br/><br/> - Tambíen conocer bien los tipos de datos de Javascript (primitivos, objetos, functions), las Function Closures, y el Type Coercion. <br/><br/> - Conocimiento de que Javascript es un lenguaje estatico y tiene un tipado dynamico."
          },
          {
            "id": "3",
            "title": "NIVEL 3",
            "type": "primary",
            "description": "- Conocimiento sobre la OOP y Functional Programming. <br/><br/> - Conocimiento sobre la palabra this y new <br/><br/> - Conceptos del ES6 (arrow functions, let y const, destructuring, etc.). <br/><br/> - Entender que son los Web APIs, como crear e implementarlos."
          },
          {
            "id": "4",
            "title": "NIVEL 4",
            "type": "primary",
            "description": "- Conocimiento avanzado de la programación funcional o object orriented programming utilizando los tres grandes frameworks (React, Angular, Vue). <br/><br/> - Conocimiento sobre WebPack, saber arrancar y configurar una applicación desde zero (configuración del package.json, i18n, CI, vite, vercel, etc.). <br/><br/> - Saber tipar el codigo utilizando el lenguaje Typescript. <br/><br/> - Crear codigo limpio y basado en el rendimiento del Engiene de Javascript. <br/><br/> - Conocimientos de Node.js con Express."
          },
          {
            "id": "5",
            "type": "secondary"
          }
        ]
      },
      {
        "id": "2",
        "title": "CSS",
        "blocks": [
          {
            "id": "1",
            "title": "NIVEL 1",
            "type": "primary",
            "description": "- Saber lo que es el Box Model los Selectors y que significa la palabra C (cascade) de CSS."
          },
          {
            "id": "2",
            "title": "NIVEL 2",
            "type": "primary",
            "description": "- Entender los conceptos de Specificity, Inheritance Spacing y saber crear un Layout manejando Flexbox."
          },
          {
            "id": "3",
            "title": "NIVEL 3",
            "type": "primary",
            "description": "- Tener conocimientos sobre los diferentes tipos de Sizing Units saber la diferencia entre Pseudo-elements y Pseudo-classes, como tambíen poder ponerlos en practica. <br/><br/> - Concimiento sobre los Gradients, el lenguaje prprocesado SCSS y la metodología BEM"
          },
          {
            "id": "4",
            "title": "NIVEL 4",
            "type": "primary",
            "description": "- Conocimientos sobre el diseño de un Layout utilizando el Grid. <br/><br/> - Conocimientos sobre las Animations y manejo de los frameworks de css Tailwind CSS, Styled Components. <br/><br/> - Conocimiento sobre los frameworks componentizados Bootstrap, Material UI, Element UI, Mantis, etc."
          },
          {
            "id": "5",
            "type": "secondary"
          }
        ]
      },
      {
        "id": "3",
        "title": "Diseño",
        "blocks": [
          {
            "id": "1",
            "title": "NIVEL 1",
            "type": "primary",
            "description": "- Conocer los conceptos básicos del diseño como el Colour que es una Line, Shape y que es la Typography."
          },
          {
            "id": "2",
            "title": "NIVEL 2",
            "type": "primary",
            "description": "- Tener presente los principios del diseño: Emphasis, Balance and alignment, Contrast, Repetition, Proportion , Movment, White Space."
          },
          {
            "id": "3",
            "title": "NIVEL 3",
            "type": "primary",
            "description": "- Entender la diferencia entre UX y UI. Saber llevar acabo una Investigation hacer un Research. <br/><br/> - Crear Wireframes en Figma utilizando un design system y componentes dinamicos."
          },
          {
            "id": "4",
            "type": "secondary"
          },
          {
            "id": "5",
            "type": "secondary"
          }
        ]
      }
    ]
  },
  "education": {
    "section": {
      "title": "Educación"
    },
    "items": [
      {
        "id": "1",
        "title": "UOC (Universitat oberta de Catalunya)",
        "date": "Sep. 2018 - Presente",
        "projects": [
          {
            "id": "1",
            "title": "Interacción Digital y Multimedia",
            "skills": [
              {
                "title": "He aprendido los conceptos básicos de diseño gráfico (teoría de los colores, tipografia, layout, etc.)."
              },
              {
                "title": "He aprendido como realizar / editar videos de manera avanzada siguiendo los patrones de la regla de los tercios y otras técnicas."
              },
              {
                "title": "He utilizado la herramienta SketchUp para transformar objetos 2d en objetos 3d."
              },
              {
                "title": "He hecho una introducción a fondo sobre la base de los lenguajes HTML y CSS y Javascript."
              },
              {
                "title": "He desarrollado una app de podcast siguiendo los principios del diseño de la interacción (des del research hasta el producto interactivo maquetado en figma)."
              }
            ]
          }
        ]
      },
      {
        "id": "2",
        "title": "IES Caparella",
        "date": "Sep. 2008 - Jun. 2012",
        "projects": [
          {
            "id": "1",
            "title": "DAW (Desarrollo de Aplicaciones Web)",
            "skills": [
              {
                "title": "He aprendido a arreglar y mantener sistemas informáticos."
              },
              {
                "title": "He adquirido conocimientos básicos del lenguaje SQL."
              },
              {
                "title": "He hecho la introducción a la programación mediante la herramienta C++."
              },
              {
                "title": "Se me ha introducido el lenguaje Javascript, el framework JQuery y he desarrollado blogs y paginas web mediante Wordpress."
              }
            ]
          }
        ]
      }
    ]
  },
  "extracurricular": {
    "section": {
      "title": "Extracurricular"
    },
    "items": [
      {
        "id": "1",
        "title": "Udemy",
        "projects": [
          {
            "id": "1",
            "title": "Desarrollo Web",
            "skills": [
              {
                "title": "Cursando actualmente: JavaScript: The Advanced Concepts (2022 Update)",
                "link": "https://www.udemy.com/course/advanced-javascript-concepts/",
                "mark": "true"
              },
              {
                "title": "The Complete Node.js Developer Course (3rd Edition)",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-4a92a6ae-3e34-45cd-91f1-9b2de4d2839d.pdf"
              },
              {
                "title": "Complete Vue Mastery 2022 (w/ Vuex, Composition API, Router)",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-a6625772-35d3-430c-b4b3-c62d18d23680.pdf"
              },
              {
                "title": "Understanding TypeScript - 2022 Edition",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-81ff333d-2f60-4c13-8df1-96231de7e852.pdf"
              },
              {
                "title": "Angular Testing Masterclass (with FREE E-Book)",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-a26124fc-480a-4fbd-ae8a-38151043d837.pdf"
              },
              {
                "title": "CSS - The Complete Guide 2022 (incl. Flexbox, Grid & Sass)",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-9000c9c0-a879-47be-b0ce-656c0d3a7bd7.pdf"
              },
              {
                "title": "Angular - The Complete Guide (2022 Edition)",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-f2b6b313-ddd1-4b71-a90f-ad6a77945752.pdf"
              },
              {
                "title": "Build Data Visualizations with D3.js & Firebase",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-1fadcda0-d80e-4b7a-95fa-5fec982d2c7b.pdf"
              },
              {
                "title": "Modern JavaScript (Complete guide, from Novice to Ninja)",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-25955b55-0cb8-4d43-ace1-d2628548cec6.pdf"
              }
            ]
          },
          {
            "id": "2",
            "title": "Diseño",
            "skills": [
              {
                "title": "Sketching for UX Designers - Boost UX work with pen & paper!",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-3768bd27-dcb4-4d37-a7cc-710cbeb2c74d.pdf"
              },
              {
                "title": "Learn Figma - UI/UX Design Essential Training",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-5d7dde08-06ce-4c66-b212-dc3fce66005b.pdf"
              },
              {
                "title": "The Complete Graphic Design Theory for Beginners Course",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-339a768e-a07a-4cac-8b5e-df87475d7d8d.pdf"
              }
            ]
          },
          {
            "id": "3",
            "title": "Desarrollo Personal",
            "skills": [
              {
                "title": "Learning to Learn [Efficient Learning]: Zero to Mastery",
                "link": "https://udemy-certificate.s3.amazonaws.com/pdf/UC-757212c0-00fb-4461-a42b-854dade0191b.pdf"
              }
            ]
          }
        ]
      },
      {
        "id": "2",
        "title": "GitHub",
        "projects": [
          {
            "id": "1",
            "title": "Next.js",
            "skills": [
              {
                "title": "Trabajando actualmente en: alex-beje-cv",
                "link": "https://github.com/AlexBeje/alex-beje-cv",
                "mark": "true"
              }
            ]
          },
          {
            "id": "2",
            "title": "React",
            "skills": [
              {
                "title": "resume-cv-website",
                "link": "https://github.com/AlexBeje/resume-cv-website"
              },
              {
                "title": "pomodoro",
                "link": "https://github.com/AlexBeje/pomodoro"
              },
              {
                "title": "virtual-piano",
                "link": "https://github.com/AlexBeje/virtual-piano"
              },
              {
                "title": "calculator",
                "link": "https://github.com/AlexBeje/calculator"
              },
              {
                "title": "random-quote-machine",
                "link": "https://github.com/AlexBeje/random-quote-machine"
              }
            ]
          }
        ]
      }
    ]
  }
}